** snippets
#+begin_src js
  ss = {color:"red", fonsize: 10};
  str = ""
  for(var k in ss) {
    str = str + k + ":" + ss[k] + ";\n";
  }
  print(str);
  
#+end_src

#+RESULTS:
: color:red;
: fonsize:10;
: 
: undefined



#+begin_src js
  var helpers  = (function() {
  
    var exports = {
  
      concatToString: function(list, term) {
        var ret = "";
        for(var i = 0; i < list.length;  i++) {
          ret = ret + list[i] + term;
        }
        return ret;
      }
  
    };
  
    return exports;
  })();
   
  
  var styles = [ "font-family: Liberation Mono;",
                 "font-style: normal;",
                 "font-size: 10px;",
                 "color: white;" ];
  
  var styleSheet = helpers.concatToString(styles, "\n");

  return styleSheet;
#+end_src

#+RESULTS:
: font-family: Liberation Mono;
: font-style: normal;
: font-size: 10px;
: color: white;
: 

#+begin_src js
  var helpers  = (function() {  
  
    var concatToString = function(list, term) {
      var ret = "";
      for(var i = 0; i < list.length;  i++) {
        ret = ret + list[i] + term;
      }
      return ret;
    };
  
    var styleSheetToString = function(styleSheet) {
      var lines = []
      for(var k in styleSheet) {
        lines.push("" + k + ": " + styles[k] + ";");
      }
      return concatToString(lines, "\n");
    };
      
    var exports = {
      concatToString: concatToString,
      styleSheetToString: styleSheetToString
    };
  
    return exports;
  })();
  
  var styles = { "font-family": "Liberation Mono",
                 "font-style": "normal",
                 "font-size": "10px",
                 "color": "white" };

  return helpers.styleSheetToString(styles);
#+end_src

#+RESULTS:
: font-family: Liberation Mono;
: font-style: normal;
: font-size: 10px;
: color: white;
: 

*** Hello World
#+begin_src js
  print("hello world");
#+end_src

#+RESULTS:
: hello world

*** Defining a function
#+begin_src js
  function myfunc() {
    return 42;
  }
  print(myfunc();
#+end_src

#+RESULTS:
: 42

*** Local and global variables
#+begin_src js
  x = 1
  function myfunc() {
    x = 2
  }
  myfunc();
  print(x);
#+end_src

#+RESULTS:
: 2
: undefined


#+begin_src js
  x = 1
  function myfunc() {
    var x = 2
  }
  myfunc();
  print(x);
#+end_src

#+RESULTS:
: 1

*** The for loop
#+begin_src js
  function myfunc() {
    for(i = 0; i < 5; i++) {
      print(i);
    }
  }
  
  myfunc();
#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4

#+begin_src js
  i = -1;
  function myfunc() {
    for(i = 0; i < 5; i++) {
      print(i);
    }
  }
  
  myfunc();
  print("---");
  print(i);
#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4
: ---
: 5


#+begin_src js
  i = -1;
  function myfunc() {
    for(var i = 0; i < 5; i++) {
      print(i);
    }
  }
  
  myfunc();
  print("---");
  print(i);
#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4
: ---
: -1

